Охотники_и_рыболовы/src/Documents/УстановкаНеучтеннойДичи/УстановкаНеучтеннойДичи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаНеучтеннойДичи</name>
  <registerRecords>InformationRegister.Ограничение</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НеучтеннаяДичь</name>
    <attributes>
      <name>Охотхозяйство</name>
      <type>
        <types>CatalogRef.Охотхозяйства</types>
      </type>
    </attributes>
    <attributes>
      <name>Дичь</name>
      <type>
        <types>CatalogRef.Дичь</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Охотники_и_рыболовы/src/Documents/УстановкаНеучтеннойДичи/ManagerModule.bsl
Процедура ПолучитьТабДок(ТабДок, ТабДокДляПечати,ПараметрыПечати) Экспорт
	
	Макет 			= Документы.УстановкаНеучтеннойДичи.ПолучитьМакет(ПараметрыПечати.ИмяМакета);
	МакетДляПечати 	= Документы.УстановкаНеучтеннойДичи.ПолучитьМакет(ПараметрыПечати.ИмяМакета + "ДляПечати");
	Ссылка 			= ПараметрыПечати.Документ;
	
	
	
Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	УстановкаНеучтеннойДичиНеучтеннаяДичь.НомерСтроки КАК Номер,
	    |	УстановкаНеучтеннойДичиНеучтеннаяДичь.Охотхозяйство,
	    |	УстановкаНеучтеннойДичиНеучтеннаяДичь.Дичь,
	    |	УстановкаНеучтеннойДичиНеучтеннаяДичь.Ссылка.СезонОхоты
	    |ИЗ
	    |	Документ.УстановкаНеучтеннойДичи.НеучтеннаяДичь КАК УстановкаНеучтеннойДичиНеучтеннаяДичь
	    |ГДЕ
	    |	УстановкаНеучтеннойДичиНеучтеннаяДичь.Ссылка В(&Ссылка)
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	Номер";
		
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("СезонОхоты",Ссылка.СезонОхоты);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ОбластьУчет				= Макет.ПолучитьОбласть("Учет");
	ТабДок.Очистить();
	
	ОбластьУчетДляПечати 	= МакетДляПечати.ПолучитьОбласть("Учет");
	ТабДокДляПечати.Очистить();
	    а = 1;
		СтруктураПараметров = Новый Структура;
		Пока Выборка.Следующий() Цикл
			ОбластьУчет.Параметры.Заполнить(Выборка);
			ОбластьУчетДляПечати.Параметры.Заполнить(Выборка);
			
			СтруктураПараметров.Вставить("Номер" + Строка(а),а );
			
			СтруктураПараметров.Вставить("Охотхозяйство" + Строка(а),Выборка.Охотхозяйство);
			
			СтруктураПараметров.Вставить("Дичь" + Строка(а),Выборка.Дичь);
			
			а = а + 1; 	

		КонецЦикла;
		ОбластьУчет.Параметры.Заполнить(СтруктураПараметров);
		ОбластьУчетДляПечати.Параметры.Заполнить(СтруктураПараметров);

		
		
	ТабДок.Вывести(ОбластьУчет);
	
	ТабДок.ПолеСверху 		= 0;
	ТабДок.ПолеСнизу 		= 0;
	ТабДок.ПолеСлева 		= 0;
	ТабДок.ПолеСправа 		= 0;
	
	ТабДокДляПечати.Вывести(ОбластьУчетДляПечати);
	ТабДокДляПечати.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабДокДляПечати.ПолеСверху 	= 0;
	ТабДокДляПечати.ПолеСнизу 	= 0;
	ТабДокДляПечати.ПолеСлева 	= 0;
	ТабДокДляПечати.ПолеСправа 	= 0;

	
КонецПроцедуры
